controllers/RestController.php

SELECT * FROM `edges` WHERE `graph_id`='8'
---
    public function actionEdges($id)
    {
        if( !is_numeric($id) ) throw new NotFoundHttpException('Page not found');
        if( !graph::find()->where(['id' => $id])->exists() ) throw new NotFoundHttpException("Object not found: $id");
        return Edge::find()->where(['graph_id' => $id])->all();

SELECT * FROM `edges` WHERE (`vertex_from`='A') AND (`vertex_to`='C') AND (`graph_id`='8')
UPDATE `edges` SET `weight`=400 WHERE `id`=11
INSERT INTO `edges` (`graph_id`, `vertex_from`, `vertex_to`, `weight`) VALUES (8, 'A', 'C', 400)
---
    public function actionRelate($id)
    {
        if( !is_numeric($id) ) throw new NotFoundHttpException('Page not found');
        if( !graph::find()->where(['id' => $id])->exists() ) throw new NotFoundHttpException("Object not found: $id");

        $model = new Edge();
        $model->graph_id = $id;
        $model->load(Yii::$app->getRequest()->getBodyParams(), '');

        $model_update = Edge::findOne(['vertex_from'=>$model->vertex_from,'vertex_to'=>$model->vertex_to,'graph_id' => $id]);

        if( $model_update != NULL ){
            $model_update->load(Yii::$app->getRequest()->getBodyParams(), '');
            if ($model_update->save()){
                $response = Yii::$app->getResponse();
                $response->setStatusCode(201);
            }
            elseif (!$model_update->hasErrors()) throw new ServerErrorHttpException('Failed to create the object for unknown reason.');
        }
        else{
            if ($model->save()) {