models/edge.php

    public function validateGraph($attribute, $params)
    {
        if( !graph::find()->where(['id' => $this->$attribute])->exists() ) $this->addError($attribute, "graph not found");
---
SELECT EXISTS(SELECT * FROM `graphs` WHERE `id`='8')