models/ShortestForm.php

    public function validateGraph($attribute, $params)
    {
        if( !graph::find()->where(['id' => $this->$attribute])->exists() ) $this->addError($attribute, "graph not found");
---
SELECT EXISTS(SELECT * FROM `graphs` WHERE `id`='8')

    public function calculation(){
    	$routes = Edge::find()->where(['graph_id'=>$this->graph_id])->asArray()->all();
---
SELECT * FROM `edges` WHERE `graph_id`='8'