models/User.php

SELECT * FROM `users` WHERE `access_token`='eEGuOntqR5FrWiAbxC1CSVP8hhOyCq2d'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token]);